package task02;

public class Ex02 {

	public static void main(String[] args) {
//		아래 키워드에 대한 설명 작성하기 
//		new 		: Heap메모리에 할당하며 저장공간의 시작주소를 가져온다
//		private		: 접근제한자 private은 같은 클래스내에서만 사용가능하다.
						//사용하기 위해서는 setter로 값을 저장하고 getter로 값을 반환하여 사용한다
//		protected	: 접근제한자 protected는 상속관계에서 보이는데 같은 패키지 내에서는 사용가능하며 자식클래스에서 사용 가능하다
						//다른 패키지에서는 사용이 불가하다
//		public		: 접근제한자 public은 대표클래스를 의미할때 사용되며 모든곳에서 접근 가능하다	
//		static 		: 정적메소드 정적 변수가 있으며 프로그램 시작과 동시에 메모리에 생성된다
						//정적 메소드, 정적 변수는 객체를 생성하지 않아도 사용할 수 있다
						//정적 변수는 객체와 상관없이 하나의 저장공간이므로 모든 객체가 공유해서 사용한다
//		extends 	: 상속을 의미하며 자식클래스가 부모클래스를 상속받을때 작성하는 키워드
//		class		: 사용자 정의 타입이며 클래스를 사용하면 여러 타입, 여러가지 값을 저장할 수 있는 저장공간을 만들 수 있다


	}

}
